brew "mas"

brew "delta"
brew "asciinema"
brew "fzf"
brew "moreutils"
brew "watch"
brew "starship"
brew "weasyprint"
brew "zinit"

# Data
brew "xsv"
brew "jq"
brew "visidata"
brew "duckdb"
cask "clickhouse"
cask "datagrip"

# Programming
brew "tldr"
brew "neovim"
brew "git"
brew "terraform"
brew "mise"
brew "go"
brew "gh"
cask "visual-studio-code"
cask "docker-desktop"
cask "ngrok"
brew "anomalyco/tap/opencode"
cask "lm-studio"
cask "zed"
cask "postgres-app"

# Productivity
brew "atuin"
brew "ripgrep"
cask "monitorcontrol"
cask "tomighty"
cask "1password"
cask "keepingyouawake"
cask "cleanshot"
cask "slack"
cask "notion"
cask "linearmouse"
cask "ghostty"

# Entertainment
brew "yt-dlp"
cask "steam"
cask "transmission"
cask "spotify"
cask "discord"

# App Store
mas "Microsoft Remote Desktop", id: 1295203466
mas "Tailscale", id: 1475387142
mas "1Blocker", id: 1365531024
mas "Spokenly", id: 6740315592
