# https://github.com/Homebrew/homebrew-bundle

brew 'mas' # https://github.com/mas-cli/mas
brew "goenv"
brew "nvm"
brew "rbenv"
brew "terraform"
brew "tldr"
brew "delta"
brew "jq"
brew "exa"
brew "bat"
brew "nvim"
brew "asciinema"
brew "fzf"
brew "git"
brew "moreutils"
brew "ripgrep"
brew "xsv"
brew "gh"
brew "doctl"
brew "azure-cli"
brew "google-cloud-sdk"

cask "monitorcontrol"
cask "tomighty"
cask "transmission"
cask "visual-studio-code"
cask "spotify"
cask "discord"
cask "docker"
cask "1password"
cask "keepingyouawake"
cask "ngrok"
cask "tuple"
cask "cleanshot"
cask "google-drive"
cask "azure-data-studio"
cask "microsoft-teams"
cask "devdocs"
cask "datagrip"
cask "slack"
cask "notion"
cask "homebrew/cask-versions/firefox-nightly"
cask "calibre" # for filename in ./*; do ebook-convert $filename ${filename%.*}.mobi; done
cask "dotnet-sdk"
cask "homebrew/cask-drivers/logitech-options"
cask "linear-linear"

# Games
cask "zwift"
cask "minecraft"
cask "steam"

# App Store
mas "Spark", id: 1176895641
mas "Hand Mirror", id: 1502839586
mas "Notion Web Clipper", id: 1559269364
mas "Microsoft Remote Desktop", id: 1295203466
mas "Tailscale", id: 1475387142
mas "1Blocker: Ad Blocker & Privacy", id: 1365531024
